//index:0 == ENFP, index:1 == ISTJ

export const questions = [
  {
    number: "01",
    type: "EI",
    question: "친구들이 말하는 나는?",
    answer: [
      "활발하고 내 의견을 얘기할 때 당당한 편!",
      "소극적이면서 조금 조용한 편.",
    ],
  },
  {
    number: "02",
    type: "EI",
    question: "새로운 장소(모임, 수업, 회사)에 가게 된 나는?",
    answer: [
      "옆자리 사람에게 먼저 해맑게 인사한다.",
      "눈이 마주치면 조심스럽게 인사한다.",
    ],
  },
  {
    number: "03",
    type: "EI",
    question: "밥을 먹다 직원을 불렀는데 오지 않을 때 나는?",
    answer: [
      "저기요~ 하며 큰소리로 직원을 부른다.",
      "앞에 있는 친구에게 ‘왜 안올까..?’ 하면서 올때까지 기다린다.",
    ],
  },
  {
    number: "04",
    type: "NS",
    question: "나는?",
    answer: [
      "일어나지 않은 일에 대한 걱정이 많고 상상력이 풍부하다.",
      "보이는 그대로 눈앞에 현재에 집중한다.",
    ],
  },
  {
    number: "05",
    type: "NS",
    question: "티비를 볼 때 나는?",
    answer: [
      "만약 내가 티비에 나간다면 나는 뭐라고할까? 재밌게 말해서 이슈가 되면 재밌겠군.",
      "ㅋㅋㅋ웃기네 재밌다!",
    ],
  },
  {
    number: "06",
    type: "NS",
    question: "데이트를 한다면?",
    answer: [
      "익숙한 것도 좋지만 색다르고 특별한 이색체험 데이트!",
      "유명 맛집이나 평소 가고 싶었던 카페를 가는 일상 데이트!",
    ],
  },
  {
    number: "07",
    type: "FT",
    question: "거절해야 하는 상황이 오면 나는?",
    answer: [
      "고민하다가 대부분 들어주는 편이다.",
      "단호하게 할 수 없다고 말한다.",
    ],
  },
  {
    number: "08",
    type: "FT",
    question:
      "고민을 얘기하는 친구, 듣다 보니 친구의 잘못인 것 같다. 그럴 때 나는?",
    answer: [
      "직접적으로 말하면 친구가 그래 할까봐 최대한 돌려서 말한다.",
      "논리적으로 친구의 잘못된 점을 말해준다.",
    ],
  },
  {
    number: "09",
    type: "FT",
    question: "누군가 힘들다며 고민상담을 할 때 나는?",
    answer: [
      "그 사람의 감정에 공감하고 정신적인 지지를 해준다.",
      "현실적인 해결책을 제시하고 응원한다.",
    ],
  },
  {
    number: "10",
    type: "PJ",
    question: "나랑 더 가까운 것은?",
    answer: [
      "내 물건들은 어디 있는지 잘 안다고 생각하지만, 막상 찾아보면 없다…",
      "정리정돈을 잘하고 내 물건이 어딨는지 잘 찾는다.",
    ],
  },
  {
    number: "11",
    type: "PJ",
    question: "나는",
    answer: [
      "그때그때 생각나는 대로 일 처리! 융통성 있게 하는 것을 좋아한다.",
      "내가 계획한대로! 계획적으로 일의 순서대로 진행하는 것을 좋아한다.",
    ],
  },
  {
    number: "12",
    type: "PJ",
    question: "계획이란",
    answer: [
      "계획? 무계획도 계획의 일부다.",
      "세세하게 세우지 않더라도 전체적인 틀과 그날 하루의 가이드라인 같은 것",
    ],
  },
];

export const results = [
  {
    type: "entj",
    title: "마리너",
    desc: "늘 열정적인 냉혈한 프로 계획러이자 한다면 무조건 해내려고 하는",
    character:
      "남들이 못한다고 하는 것은 '하면 할 수 있지'라는 마인드로 반드시 증명해내려고 해요. \n 한 개의 목표보다 여러 개의 목표를 동시에 진행 중인 목표지향적인 사람입니다. \n 몸이 힘들어도 내가 계획한 우선순위에 있는 걸 먼저 끝내고 자는 게 마음에 편해요. \n 내가 제일 소중하고 내가 제일 성공했으면 좋겠다는 생각을 하고 있어요.\n 일을 좋아한다기보다 무언가에 열중하고 집중한 나의 모습이 마음에 들어요.\n 착하기만 한 것 보다 일 잘한다 소리가 더 좋고 그 소리 들으면 더 열심히 하려고 해요.",
    favorite:
      "말과 행동이 가벼운 사람은 같이 있고 싶지 않아요. 불호가 매우 강한 사람이라 그 사람이 싫으면 칼같이 정리해요. 내가 존중할 수 있고 똑똑한 사람을 좋아해요.\n너무 퍼주는 사람은 부담스러워하고 밀당하기엔 시간이 아까워요.\n 너무 감정적인 사람과 있으면 힘들고 의미 없는 대화보다 미래의 비전을 위한 대화를 좋아해요.\n늘 계획을 중요시 여기기 때문에 게으르지 않고 계획적인 사람이 좋아요.",
    hateful:
      "효율적인 시스템을 좋아해서 비효율적이라고 생각하면 표정에서부터 바로 드러나요.\n멍청한 소리를 하거나 너무 감정적인 사람과 있는 게 제일 힘들어요.\n노력도 안 하면서 못하겠다고 말하는 사람을 보면 답답하고 이해가 안 가요.\n당한 건 돌려주려고 하고 나에게 무언갈 해주면 또 그만큼 해주려고 해요.\n논쟁을 좋아하고 꼭 이겨야 해서 나에게 지는 건 있을 수 없는 일입니다",
    goodmatch: ["오션베이", "마야 블루"],
    badmatch: ["어떤 컬러든 상관없지! 다 괜찮아요!"],
  },
  {
    index: 1,
    type: "entp",
    title: "발렌시아",
    desc: "어린 아이같은 다양한 관심사와 자유롭고 늘 즐거운 아이디어 뱅크",
    character:
      "창의력이 뛰어나고 머리가 좋으며 다른 사람을 파악하는 게 매우 빨라요.\n싸우더라도 화나 있다가 그런 감정 오래두면 귀찮아서 금방 화해하고 풀어요.\n늘 즐거운 또라이! 긍정적이고 재밌는 거라면 일단 다 알아야 해서 지식이 넓고 얇아요.\n독립심이 강하고 내 사람과 아닌 사람의 구분과 호불호가 명확해요.\n자기애가 넘치고 자기합리화를 잘하며 내 주장에 대한 엄청난 확신을 가지고 있어요.\n내가 하고 싶은 대로 하기 때문에 웬만한 일로 스트레스받지 않아요.",
    favorite:
      "터무니없는 말만 하는 사람보다 직접 행동으로 옮기는 사람을 좋아해요.\n스스로 성장하고 비전이 있는 사람에게 호감을 느끼며 같이 있을 때 내가 같이 성장할 수 있고 리스펙할 수 있는 사람이 좋아요! 공감, 리액션을 잘해주고 관심을 가져주는 사람!\n밀당이나 나와 의견이 맞지 않을 때 우기기보다 잘 들어주는 사람이 좋아요!\n나를 잘 챙겨주고 똑똑하며 허세가 없는 사람이 좋습니다!",
    hateful:
      "고집이 세고 자존심이 매우 강력한 사람이라 정해진 틀이나 반복적인 일을 싫어해요.\n지시하거나 효율적이지 못한 시스템, 나이로 뭐라 하는 것을 굉장히 싫어해요.\n매우 쿨한 것 같지만 반격이나 저격당하면 '근데? 어쩌라고?'라고 하지만 이미 화나 있어요.\n내 사람이 아니라면 표현하는데 거침이 없고 싫어하는 사람이라면 날 어떻게 생각하던 신경 쓰지 않아요. 감정 기복이 큰 편이라 가끔 스스로가 통제하기 힘들어요",
    goodmatch: ["훅스 블루", "빌로바 플라워"],
    badmatch: ["어떤 컬러든 상관없지! 다 괜찮아요!"],
  },
  {
    index: 2,
    type: "estp",
    title: "탄제린",
    desc: "스릴 넘치는 걸 좋아하는 쿨냄새 가득하고 위기 탈출 넘버원처럼 임기응변이 뛰어난",
    character:
      "과정보다는 결과가 중요하고 공감 능력은 떨어지지만, 속이 깊고 정이 많아서 공감해줘요.\n남들이 볼 때 둔해 보일 때도 있지만 귀찮아서 안 하고 못 알아듣는 척해요.\n즉흥적이고 자유분방하며 성격이 단순하고 매사에 자신감이 넘치고 지는 걸 싫어해요.\n순발력, 임기응변, 재치가 뛰어나고 눈치가 빠르고 제일 마지막까지 미루지만, 막상 시작하면 머리가 똑똑해서 잘해요. 내 감정을 표현하는데 거침이 없고 상대방의 감정도 잘 파악해요.\n내 사람이라고 생각하면 매우 잘 챙겨주고 내 시간, 돈 들여서 한 번이라도 더 챙겨줘요.",
    favorite:
      "나의 개인적인 영역에 침범하지 않고 내 개인사에 지나친 관심을 갖지 않는 사람이 좋아요.\n즉흥적인 내 스타일에 맞게 함께 어울려줄 수 있는 사람이 좋아요!\n잘난 척, 아는 척하는 사람은 힘들어요.\n나에게 가르치려 하는 사람보다 같이 대화하고 토론이 가능한 사람과 잘 맞아요.\n자유분방하고 주변에 사람이 많아서 집착하지 않는 사람이 좋아요.",
    hateful:
      "유혹, 내기 등 너무 좋아하지만, 또 금방 싫증 나서 빠져나오기 때문에 잔소리는 안 했으면 해요. 늘 뭐 어떻게든 되겠지 라는 마음으로 무계획도 계획이라고 생각해요.\n돌려서 말하는 걸 세상 제일 싫어하고 할 말 있는 것 같은 데 우물쭈물거리면 답답해 미쳐요.\n자유로운 사람이고 개방적인데 통제하거나 날 억압하면 화가 나고 감정적으로 너무 힘들게 하면 피하고 싶어요.",
    goodmatch: ["그랜디스", "게인스보로"],
    badmatch: ["아쿠아마린", "훅스 블루", "제노아", "선셰이드"],
  },
  {
    index: 3,
    type: "esfp",
    title: "프롤리",
    desc: "에너지가 넘치는 말보다 행동파! 이 모든 세상이 즐거운",
    character:
      "'해보면 알겠지/뭐 때 되면 알겠지/그럴 수 있지'라는 말을 많이 해요.\n성격이 매우 급하고 마무리가 잘 안되는 덜렁이지만 매력이 넘치고 긍정적!\n금방 잘 까먹어서 무슨 일로 싸웠는지 기억 못하고 다시 좋아지는 경우가 많아요.\n대화하는 걸 좋아해서 나도 모르게 말실수를 많이 해요.\n상대방의 표정이나 행동 하나로 감정을 파악해 눈치가 빠르지만 내 일엔 눈치가 없어요.\n어색한 거 못 참고 스스로 아싸라고 생각하지만, 주변에 아는 지인이 제일 많아요.",
    favorite:
      "핸드폰이 잠잠한 걸 싫어하는 나는 연락을 자주 해주는 사람이 좋아요!\n가만히 내가 집에 있기보다 뭐 하자~ 하면서 약속을 많이 잡는 사람이나 심심할 때 연락해도 편안하게 받아주는 사람이랑 잘 맞아요!\n내 생일이나 기념일에 선물이나 깜짝 이벤트를 해주는 사람에게 감동해요!\n너무 진지하거나 무뚝뚝한 사람과는 조금 힘들어요.",
    hateful:
      "재밌는 곳이나 핫한 자리에 막상 안 불러주면 세상 제일 서운하고 신경 쓰여요.\n하기 싫은 건 안 하려고 계속 미루다가 결국 나중에의 제일 나중에 해요.\n혼자 있는 걸 제일 힘들어하고 유리멘탈입니다.\n즉흥적인 사람이라 너무 계획적이거나 틀에 박힌 것을 싫어해요!\n다른 사람을 위해 깜짝 이벤트를 자주 준비하는데 정작 내가 못 받으면 서운해요.",
    goodmatch: ["그랜디스", "게인스보로"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 4,
    type: "esfj",
    title: "코스모스",
    desc: "정이 많은 활발한 인싸 댕댕이지만 가끔은 비련의 여주인공이 되어버리는",
    character:
      "자기 전 세상 제일 우울하고 감정의 골이 깊은 드라마 주인공이지만 자고 일어나면 개운해요.\n일어나지 않은 일에 대해 쓸데없는 걱정이 많은 스타일입니다.\n혼자 놀고 연락이 귀찮지만, 막상 연락 없으면 불안해요.\n즉흥적인데 즉흥적으로 세운 것을 다시 세밀하게 계획 짜요.\n사실 낯을 많이 가리는 데 안 그런 척하고 친하게 지내지만 완벽한 내 사람이 아니면 숨겨요.\n대화하는 걸 좋아하고 분위기 메이커라 리더 역할을 잘하며 공감 능력이 뛰어나요.",
    favorite:
      "다정다감하고 배려심이 깊으며 자상한 사람이 좋아요!\n너무 부담스럽게 다가오기보다 선 넘지 않고 천천히 다가와 주는 사람이 좋아요.\n진짜 내 편, 내 사람이 되어주는 사람이 좋고 나를 공감해주는 사람이 좋고, 기복이 심하기보다 안정적이며 편안한 관계를 선호해요.\n늘 들어주고 위해주는 내가 정말 힘들 때 의지가 될 수 있는 사람을 원해요.",
    hateful:
      "나도 세상 제일 활발하지만, 너무 활발하고 텐션 높은 사람을 만나면 기가 빨려요.\n남에게 싫은 소리 하는 걸 제일 힘들어해서 늘 꾹 참고 있어요.\n사실 진짜 공감이 안 가도 공감 가는 척하거나 이해하는 척해요.\n감정 기복이 하루에도 수십 번씩 왔다 갔다 하기 때문에 감정이 얼굴에 드러나요.\n혼자 있고 싶은데 혼자 있는 걸 싫어하고 외로워서 누구라도 같이 있어야 해요.",
    goodmatch: ["올리빈", "보스턴블루"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 5,
    type: "enfj",
    title: "아쿠아마린",
    desc: "사람을 좋아하고 평화를 중시하는 문제 해결러이자 표현력 끝판왕",
    character:
      "늘 도움이 되고 싶어 하며 다른 사람의 즐거움을 위해 희생해요.\n문제가 생기면 제일 먼저 달려가서 해결해주려고 하고 내 고민처럼 생각해서 가끔 피곤해요.\n표현력이 뛰어나 말을 잘하고 주변 사람들에게 믿음직스러운 사람입니다.\n긍정적이고 처음 보는 사람한테 말을 잘 걸어요!\n기분이 안 좋으면 짜증 내고 그 짜증에 대한 미안함과 후회로 죄책감에 시달려요.\n완벽해지고 싶은데 잔 실수가 있고 스트레스받으면 세상 제일 우울해요.",
    favorite:
      "나를 이해해주고 고맙다고 인정해주는 사람에게 크게 감동 해요.\n먼저 다가와 주는 사람이 좋고 내 이야기를 잘 들어주며 진심 어린 공감을 해주는 사람에게 호감이 가요. 나의 능력을 긍정적으로 얘기해주는 사람!\n나랑 대화가 잘 통하며 인정과 칭찬을 잘 해주는 사람이 좋아요.\n다른 사람은 잘 챙겨주지만 자신을 챙기지 못해 날 챙겨주고 위해주는 사람이 좋아요!",
    hateful:
      "남을 도와주는 이유는 내가 사랑받기 위함인데 누군가 날 싫어할까 불안해해요.\n외로움을 많이 타고 사람을 좋아하기 때문에 버려진다는 느낌이 제일 싫어요.\n갈등 상황이 제일 힘들지만 지는 건 싫어서 분노가 치밀어오르면 건들지 않는 것이 좋아요.\n너무 지나치게 상대방을 배려해서 손해 보는 내가 싫은데 또 같은 행동을 반복해요.\n귀가 매우 얇고 사람을 잘 믿어서 칼같이 맺고 끊는 걸 어려워합니다.",
    goodmatch: ["올리빈", "제노아"],
    badmatch: [
      "코스모스",
      "글레이드",
      "프롤리",
      "보스턴블루",
      "그랜디스",
      "게인스보로",
      "탄제린",
    ],
  },
  {
    index: 6,
    type: "infp",
    title: "제노아",
    desc: "조용한 관종인데 관심 받으면 두려운 착하지만 게으른 완벽주의자",
    character:
      "귀차니즘이 매우 심해서 잘 안 나가다가 한 번 나가면 감탄하면서 '내일도 나와야지' 하지만 다음 날 절대 안 나와요. 생각이 많고 상처를 잘 받으며 자기애는 높지만, 자존감이 낮아요.\n남들도 나와 같이 상처받을 거라 생각하고 말할 때 최대한 돌려 말해요.\n나에 대한 태도의 변화에 예민해서 바로 알아차리기 때문에 방어기제로 정을 잘 주지 않아요.\n울고 싶지 않은 데 정말 괜찮냐고 물어보면 눈물이 주체할 수 없이 나와요.\n내가 정말 좋아하는 사람에 대해서는 뭐든지 알고 싶은데 아닌 사람은 그냥 신경도 안 써요.",
    favorite:
      "낯을 많이 가리고 많이 부끄러워하지만, 속으로는 관종이기 때문에 나와 정서적 교감이 잘 통하는 사람이 좋아요. 나를 계속 좋아한다며 티 내주고 감정을 표현해주는 사람이 좋아요.\n나의 이야기를 잘 들어주고 내 코드와 맞는 사람이 좋아요!\n사소한 말에도 쉽게 상처받는 나에게 다정하고 이쁘게 말해주는 사람이 좋습니다.\n나의 특별함에 대해 계속 칭찬해주고 응원해주는 사람이 좋아요.",
    hateful:
      "내가 '괜찮다'하는 말은 거의 거짓일 확률이 높으니 내가 괜찮다고 해도 전혀 안 괜찮은 겁니다.\n잡생각이 많고 유리멘탈의 소유자라 나에게 말을 너무 날카롭게 하지 말아주세요.\n백번 잘해줘도 한번 안 해주면 내가 뭐 잘못한 게 있나 하고 우울해해요.\n스트레스를 받으면 지금껏 힘들었던 내 인생의 모든 것이 떠오르며 생각이 꼬리를 물어요.\n잔소리나 싸우는 게 귀찮아서 차라리 내가 희생하고 남들에게 민폐 끼치는 걸 제일 싫어해요.",
    goodmatch: ["아쿠아마린", "마리너"],
    badmatch: [
      "코스모스",
      "올리빈",
      "프롤리",
      "글레이드",
      "그랜디스",
      "보스턴블루",
      "탄제린",
      "게인스보로",
    ],
  },
  {
    index: 7,
    type: "isfp",
    title: "올리빈",
    desc: "소심하지만 마음에 없는 소리 못하는 귀차니즘의 끝판왕이자 순둥한",
    character:
      "착하면서 착하지 않고 관심받기 싫은데 받고 싶고 연락하는 거 귀찮은데 안 오면 섭섭해해요.\n양보하고 매우 배려심이 깊지만 은근 개인주의고 대충하고 싶어도 하면 또 완벽해야 해요.\n이미 아무것도 하고 있지 않아도 아무것도 하고 싶어 하지 않아요.\n습관성 미루기! 진짜 최종의 최종까지 미루다가 시작해요.\n엄청 낯가리고 내성적인데 친해지면 드립+팩폭으로 전혀 다른 사람이 될 때가 있어요.\n속마음을 잘 말하지 않고 늘 숨기며 다른 사람의 고민을 잘 들어줘요.",
    favorite:
      "나에게는 첫인상이 가장 중요해요!\n내가 표현하는 만큼 나에게 표현해주고 내 개인 영역을 침범하지 않는 사람이 좋아요!\n나와 가치관이 비슷하고 나에게 진심 어린 칭찬과 인정을 해주는 사람!\n잘 웃어주고 부드러우면서 천천히 다가오는 사람이 좋아요! 마음이 열리기까지 오래 걸리기 때문에 감정을 강요하기보다 기다려주는 사람이 좋습니다!",
    hateful:
      "은근 확고한 고집이 있어서 억지로 강요하거나 내 자존심을 건들이면 크게 화가 나요.\n내가 싫어하는 사람에게 소심한 저항을 마음속으로 해서 티가 안 나요.\n독립적인 성향이 있는 나에게 개인 시간은 필수! 개인 공간을 침범하면 화가 나요.\n사람이 너무 많은 자리는 싫고 다른 사람이 날 어떻게 볼지 신경 쓰고 싶지 않아도 신경 쓰여요.\n감정 표현을 잘 못하고 겉으로는 차가워 보일 때도 있지만 속으로 매번 고민하고 생각해요.",
    goodmatch: ["보스턴블루", "마야 블루"],
    badmatch: ["혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 8,
    type: "isfj",
    title: "그랜디스",
    desc: "섬세하고 배려심이 깊은 친절한 모범생이지만 마음 속에선 끓고 있는 분노 화산같은",
    character:
      "전화가 오면 2초 안에 여러 가지 생각이 지나가지만 침착한 척 전화 받아요.\n눈치가 매우 빠르고 사소한 거에 걱정이 많고 지나치게 완벽 마무리하고자 해요.\n반은 내성적이면서 반은 외향적이라 친화력은 있지만 낯을 엄청 가려요.\n다른 사람에게 배려심이 깊고 공감을 잘 해주며 사람 사이의 관계에 관심이 많아요.\n나서기보다 조화롭게 협력하는 스타일이며 모든 계획대로 하는 게 마음이 편해요.\n늘 메모하며 성실하고 책임감 있게 모든 일을 처리해요.",
    favorite:
      "너무 게으르기보다 성실하고 똑똑한 사람에게 호감을 느껴요.\n계획적이고 완벽주의자의 성향이 있어 대충하기보다 늘 열심히 하는 사람이 좋아요.\n늘 다른 사람을 배려하고 챙겨주는 나를 같이 배려하고 내가 해주는 만큼 해줄 수 있는 사람이 좋아요. 모든 사람이 아닌 나에게만 잘해주는 사람!\n내가 열심히 노력해서 이룬 것에 대한 칭찬을 아끼지 않는 사람이 좋습니다!",
    hateful:
      "늘 배려심이 깊고 섬세한 나는 가끔 표출하지 못한 내면의 분노가 있어요.\n늘 모든 사람을 이해하려고 노력하지만 내 기준에서 벗어나는 행동을 한다면 두 번 다시 보지 않으려 해요. 다른 사람에겐 관대하지만 나 자신에겐 엄격해요.\n내가 싸우거나 남들이 싸운다면 보기 힘들어서 그 자리를 피해요.\n너무 활발한 사람들과 있으면 피곤하고 너무 조용한 사람과 있으면 어색해서 싫어요",
    goodmatch: ["프롤리", "탄제린"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 9,
    type: "infj",
    title: "혹스 블루",
    desc: "매사에 신중하고 조심스러운 시인이자 잘 들어주는 공감왕",
    character:
      "사소한 거 잘 기억해주는 사람에게 감동하고 눈물이 많은 편입니다.\n혼자 조용한 곳에 있는 걸 좋아하고 혼자 생각 정리할 시간이 꼭 필요해요.\n내면에 숨겨진 또라이가 있지만 내성적이라 티가 나질 않아요.\n누가 싫어도 속마음 절대 드러내지 않고 은근 웃으면서 잘 디스해요.\n평소 작은 거 하나에도 감동하고 감사함을 느끼며 세상을 바라보는 시각이 마치 시인처럼 감수성이 매우 풍부해요. 내 문제가 아닌 다른 사람 일에도 내 일처럼 생각해요.",
    favorite:
      "내 속마음을 말하기까지가 힘든데 말할 수 있을 것 같은 믿음직한 사람이 좋아요.\n예의가 바르고 도덕적인 사람이 좋고 나에게 혼자만의 시간을 주는 사람이 좋아요.\n다정다감하고 배려심이 깊은 사람에게 호감이 가요!\n나를 너무 대놓고 좋아하기보다 자연스럽게 나를 귀여워해 주는 사람이 좋아요!\n나와 관심사가 잘 통하거나 대화가 잘 통하는 사람이 좋아요!",
    hateful:
      "쓴소리나 피드백 시간이 제일 어렵고 아쉬운 소리 하면 밤잠 못 이루고 마음에 걸려서 자신을 탓해요. 생각이 깊고 혼자만의 시간을 가지기 때문에 부정적인 생각에 빠지면 계속 우울해해요. 늘 긴장이 연속되는 삶을 살고 있어요.\n신중한 완벽주의자라 행동하기 전 늘 생각하고 또 생각해서 시작을 못 해요.\n예의 없는 사람이 세상에서 제일 싫고 나와 가치관이 맞지 않으면 선을 그어버립니다.",
    goodmatch: ["선셰이드", "발렌시아"],
    badmatch: [
      "코스모스",
      "올리빈",
      "프롤리",
      "글레이드",
      "그랜디스",
      "보스턴블루",
      "탄제린",
      "게인스보로",
    ],
  },
  {
    index: 10,
    type: "estj",
    title: "글레이드 그린",
    desc: "추진력 갑! 냉정한 워커홀릭이자 시간 약속에 철저한 공공질서의 끝판왕",
    character:
      "밖으로는 센 척, 당당한 척하지만 속은 여린 스타일, 은근 상처 잘 받아요.\n어리광 부리고 싶은데 성격 자체가 그게 잘 안되는 스타일입니다.\n완벽하지 않으면 안될 거라는 강박관념으로 과정보다 결과를 더 중요시 여겨요.\n인간관계에 아니라면 가차 없이 차단하고 그 시간에 내 사람에게 더 잘해주려고 해요.\n게으름이란 없고 제때 일하며 확실하게 일 처리하고 완벽하게 마무리하려고 해요.\n내 고민을 털어놓고 싶지만 해결될 것도 없고 내가 해결할 몫이라고 생각해서 말하지 않아요.",
    favorite:
      "깊은 얘기가 가능하며 대화로 통하는 사람이 좋아요.\n한 말, 약속은 반드시 지키는 사람에게 호감을 느끼고 즉흥적인 사람과는 맞지 않아요.\n본인 일에 성실하고 배울 점이 있는 사람이 너무 좋아요.\n물질적으로나 나를 티 나게 챙겨주고 표현해주는 사람이 좋고, 사생활을 존중해주고 나에게 너무 지나친 사랑을 요구하지 않는 사람이 좋아요!",
    hateful:
      "나 자신에게 매우 엄격한 스타일이라 사소한 거, 미루는 것까지도 계산하고 계획해요.\n나에게 시간은 매우 중요한데 약속 시간 안 지키거나 즉흥적인 걸 제일 싫어해요.\n잔소리는 나에게 애정표현이고 관심 없으면 하지도 않는데 몰라주면 서운하기도 해요.\n일을 못 하는 사람이나 게으른 사람을 보면 답답하고 짜증이 나요.\n너무 지나치게 감정적이거나 외로워하는 사람을 보면 이해가 안 가요.",
    goodmatch: ["보스턴블루", "마야 블루", "올리빈"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 11,
    type: "istp",
    title: "마야 블루",
    desc: "같은 말 계속 반복하기 싫어하는 세상에 관심 없는 독특한 천재 자연인",
    character:
      "사실 못 알아들었는데 다시 물어보기 민망해서 알아들은 척해요.\n대화하다가 딴생각을 많이 해서 뒷북치는 경우가 많지만, 남들이 나에게 물어보는 건 안 돼요.\n호불호가 명확하지만 단호하게 말하기 힘들어서 '이건 어때?'라며 돌려서 말해요.\n나에게 관심을 가지면 너무 부끄럽지만 그래도 날 신경 써줬으면 좋겠어요.\n내가 해야 하는 걸 알지만 계속 미루는! 게으르지만 똑똑한 사람입니다.\n자존감은 낮지만, 자기애가 강하고 감정 기복이 심하며 유리멘탈이고 혼자 있는 걸 선호해요.",
    favorite:
      "무논리로 목소리 큰 사람과는 맞지 않고 똑똑하거나 똑 부러진 사람에게 호감이 가요.\n내가 존경할 만한 사람! 과도하게 나에게 집착하고 밀당하는 사람은 싫어요.\n부담스럽기보다 내가 먼저 좋아하고 호감이 가는 사람이 좋아요.\n배려심이 깊고, 다혈질이기보다 인내심이 깊은 사람이 좋아요!\n나와 취향이 비슷하고 내 개인영역을 함부로 침범하지 않는 사람이 좋아요!",
    hateful:
      "쉽게 화내지는 않지만, 누군가 선을 넘는 행동을 한다면 서늘해지고 화가 나요.\n하지만 일 크게 만들기 싫어서 참아요. 나에게 머리가 나쁘다거나 무식하다는 발언은 장난이라도 참을 수 없어요. 한 번 거슬리는 거 있으면 밤새서라도 내가 생각한 대로 손을 봐야 직성이 풀려요. 연락 자체를 귀찮아하지만 또 안 하면 외로워요. 남에게 피해주는 걸 싫어하고 딱히 관심이 없어 내 욕을 하든 말든 신경 안 쓰고 남 욕도 안 해요.",
    goodmatch: ["마리너", "글레이드"],
    badmatch: ["어떤 컬러든 상관없지! 다 괜찮아요!"],
  },
  {
    index: 12,
    type: "intj",
    title: "빌로바 플라워",
    desc: "겉으로는 부드러워 보이지만 속은 매우 칼 같고 진지한 영혼 없는",
    character:
      "냉정하고 차갑다는 말을 자주 듣지만 실제로 겪어보면 감수성이 풍부해요.\n은근히 허당끼가 있고 속정이 깊으며 무심한 듯하지만 잘 챙겨줘요.\n관심 없는 부분은 아예 모르지만 내가 관심있는건 전문가 수준으로 지식이 많이요.\n고집이 세고 내 의견에 확고한 확신이 있어요!\n예의가 바르긴 하지만 말투가 날카로운 편이라 다른 사람이 상처받을 수 있어요.\n혼자 있는 걸 좋아하고 혼자만의 시간이 필요해요.",
    favorite:
      "예의가 바르고 차분하며 배려심이 가득한 사람을 좋아해요!\n비효율적이기보다 효율적으로 일 처리 하는 사람에게 호감을 느껴요.\n갑자기 만나자거나 즉흥적인 연락보다 사생활에 존중해주는 사람이 좋아요!\n나에게 감정적인 호소를 하는 사람이나 말이 너무 많은 사람은 피하고 싶어요.\n거짓말을 하지 않고 솔직한 사람이 좋아요!",
    hateful:
      "리액션과 공감을 제일 못하고 대화할 때 결론이 중요해 돌려 말하는 걸 싫어해요.\n비효율적인 걸 싫어하고 고민 상담 들어주는 게 제일 힘들어요.\n속으로는 이해하는데 나의 감정을 표현하기가 어려워요.\n인간관계에서 칼 같은 부분이 있어 아니라고 생각하면 연락 안 해요.\n너무 확고한 내 생각이 있어 하나부터 열까지의 이유를 말해야 나의 고집을 꺾을 수 있어요.",
    goodmatch: ["선셰이드", "발렌시아"],
    badmatch: ["어떤 컬러든 상관없지! 다 괜찮아요!"],
  },
  {
    index: 13,
    type: "intp",
    title: "보스턴블루",
    desc: "영혼 없는 게으른 천재 스타일! 노력 대비 결과가 잘 나오면 뿌듯한",
    character:
      "인간관계 좋고 대화할 때 공감하고 위로해줄 수 있지만 굳이 필요 없으면 하지 않아요.\n느긋해서 발등에 불이 떨어져도 안 하고 타오르기 시작할 때 시작해요.\n조급하거나 불안해도 티를 내지 않고 '어떻게든 되겠지' 라며 넘어가요.\n태어난 김에 사는 거니? 라고 하지만 뒤처지기 싫어서 열심히 해요. '굳이?/알아서 하겠지~'라는 말을 많이 하며 기계조작을 잘해요.\n하기까지가 귀찮아서 그렇지 활동적인 거 좋아하고 내가 좋아하는 건 프로 소비러!",
    favorite:
      "계속 연락을 요구하는 사람보다 그냥 내버려 두는 사람이 좋아요.\n나의 일상을 방해하고 간섭하는 사람보다 혼자만의 시간을 이해해주는 사람이 좋아요.\n애매한 표현으로 사람을 헷갈리게 하기보다 정확한 의사전달을 해주는 사람이 편해요!\n일부러 밀당을 한다거나 질투심을 유발하는 사람에게 정떨어져요.\n내가 먼저 좋아하면 그 사람만 보이고 관찰하며 분석하고 다른 사람에게는 관심이 없어요.",
    hateful:
      "내 상황 말해봐야 나아지는 거 없다고 생각하기 때문에 공감 능력이 떨어져요.\n남 일에 간섭하지 않기 때문에 누군가 내 일에 간섭하면 극도로 화가 나요.\n피해주는 것도 받는 것도 싫고 나에게 찡찡거리는 것도 싫어요.\n공감이 가능하지만 귀찮게 내가 굳이 나서지 않아도 되면 하지 않아요.\n갑자기 약속 시간을 앞당기는 걸 싫어하고 나갈 일 생기면 한꺼번에 모두 다 처리해요.",
    goodmatch: ["글레이드", "코스모스"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 14,
    type: "istj",
    title: "게인스보로",
    desc: "강한 책임감으로 팩트를 중요시 여기는 개근상의 끝판왕인",
    character:
      "나 자신에게 엄격해서 혼자만의 목표를 지키지 못하면 죄책감에 시달려요.\n계획에 맞춰 빠르게 마무리하는 게 제일 좋아요.\n다른 사람의 감정을 아는 게 힘들어 의식적으로 눈치를 보고 살피려고 해요.\n창의적이기보다 딱 배운 것만 엄청 잘하는데 내가 몰라서 못 한 건 내 잘못이라고 생각 안 해요.\n혼자가 제일 편하지만, 세상은 혼자 살아가는 게 아니라서 외로워요.\n한결같이 진지하고 규칙에 엄격해 보수적이지만 친해지면 의외의 모습이 보여요!",
    favorite:
      "약속을 잘 지키는 책임감 있고 신뢰감을 주는 사람이 좋아요!\n예의가 바르며 갈등하기보다 평화주의자인 사람과 있으면 편해요!\n너무 시끄럽기보다 조용히 날 챙겨주고 먼저 도와주는 사람!\n충동적인 사람은 힘들고 너무 지나치게 활동적인 사람은 힘들어요.\n감정적인 표현을 잘하지 못해서 나에게 요구하기보다 성숙한 사람이 좋아요!",
    hateful:
      "일할 때 계속 논점 흐리거나 제대로 참여하지 않는 사람을 보면 스트레스받아요.\n말을 잘 못 알아듣거나 논리가 안 통하는 사람을 보면 화가 나요.\n시간 약속이나 예의가 없는 사람들을 극혐하고 극도의 분노가 치밀어 올라요.\n직접 대화하기 보다 SNS가 더 편하고 만나면 왠지 모를 어색함을 느껴요.\n남들의 TMI나 사적인 얘기 들을 때 뭐라고 반응해야 할지 몰라서 불편해요.",
    goodmatch: ["프롤리", "탄제린"],
    badmatch: ["아쿠아마린", "혹스 블루", "제노아", "선셰이드"],
  },
  {
    index: 15,
    type: "enfp",
    title: "선셰이드",
    desc: "호기심 가득한 어린아이 같이 늘 즐겁지만 소심한 감정 부자",
    character:
      "완벽한 인싸의 끝판왕! 하루에도 수백 개의 생각이 왔다 갔다 해요!\n밝아 보이지만 내면의 슬픔이 가득한 상태가 오히려 더 밝은 척하는 경우가 많아요!\n남에게 상처 줬을까 신경 쓰여서 하루종일 안절부절못하고 모두 내 잘못인 것 같아요!\n사람을 매우 좋아하고 순두부 멘탈 같지만 금방 털어버리는 긍정왕입니다.\n눈치가 빠르고 다 알고있지만 내가 손해 보거나 하기 싫으면 모른척해요.\n표현력이 매우 풍부하고 놀기를 좋아하는 행동대장! 자유로운 영혼입니다.",
    favorite:
      "세심하게 나에 대해 기억해주는 사람이 좋고 감정 기복이 심해서 잔잔한 사람이 좋아요!\n같이 있어도 함께 하면 편안함을 느끼는 사람에게 마음이 잘 가요!\n늘 의심과 걱정이 많아 확실하고 지속적인 애정을 표현해주는 사람이 좋아요!\n늘 선을 넘지 않고 나 혼자만의 시간도 이해해주는 사람!\n마무리를 잘 못 하고 다소 산만한 나와 달리 한 분야의 전문가 같은 사람에게 마음이 가요!",
    hateful:
      "굉장히 활발하고 긍정적이며 다 이해해줄 것 같지만 선 넘는 건 싫어요.\n항상 웃고 남을 위해 웃겨주지만, 집에 돌아오면 녹다운이 되어버려요.\n주변에 사람이 많지만, 진정으로 나를 위한 사람은 몇 명일까 하며 우울해지고 외로워져서 사랑을 받고 싶어 해요.\n다른 사람이 잘못해도 나 때문일까 하며 하루종일 생각하고 또 생각해요.",
    goodmatch: ["혹스 블루", "빌로바 플라워"],
    badmatch: [
      "코스모스",
      "올리빈",
      "프롤리",
      "글레이드",
      "그랜디스",
      "보스턴블루",
      "탄제린",
      "게인스보로",
    ],
  },
];

export const mbtis = {
  entj: 0,
  entp: 1,
  estp: 2,
  esfp: 3,
  esfj: 4,
  enfj: 5,
  infp: 6,
  isfp: 7,
  isfj: 8,
  infj: 9,
  estj: 10,
  istp: 11,
  intj: 12,
  intp: 13,
  istj: 14,
  enfp: 15,
};
